import numpy as np

# 设置打印选项，增加小数点后的位数
np.set_printoptions(precision=16, suppress=True)

# 定义矩阵 A
A = np.array([
    [0.9999987866043378, -0.0009001898403121543, -0.0012713961237869695, -0.050526626892750615],
    [0.0009036152860222907, 0.9999959568769727, 0.002696239811813946, -0.0014657458728452213],
    [0.0012689638556903846, -0.002697385393180297, 0.9999955569115164, -0.0009616136776146613],
    [0.0, 0.0, 0.0, 1.0]
])

# 计算矩阵的逆
A_inv = np.linalg.inv(A)

# 显示结果
print('矩阵A的逆为：')
print(A_inv)

imu = 1.180922466461009e-05
imu_rate = 200
imu_vins = imu * np.sqrt(imu_rate)

print("imu_vins: ", imu_vins)